environments/cfd/rand_env_10/system/snappyHexMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object snappyHexMeshDict;
}

castellatedMesh yes;
snap yes;
addLayers no;
geometry
{
  rand_env_10_flow_vol.stl
  {
    file "rand_env_10_flow_vol.stl";
    name flow_vol;
    type triSurfaceMesh;
  }
} 	// Settings for the castellatedMesh generation.

castellatedMeshControls
{
  maxLocalCells 100000;
  maxGlobalCells 200000;
  minRefinementCells 10;
  maxLoadUnbalance 0.1;
  nCellsBetweenLevels 1;
  features
    (

      {
        file "rand_env_10_flow_vol.eMesh";
        level 3;

      }
    );
  refinementSurfaces
  {
    flow_vol
    {
      level
        (
          3
          3
        );
    }
  } 	// Surface-wise min and max refinement level// Optional specification of patch type (default is wall). No// constraint types (cyclic, symmetry) etc. are allowed.// Resolve sharp angles
  resolveFeatureAngle 80;
  refinementRegions
  {
    refinementBox
    {
      mode inside;
      levels
        (

          (
            1000000000000000.0
            4
          )
        );
    }
  }
  locationInMesh (1.2142857142857142 4.0 1);
  allowFreeStandingZoneFaces yes;
} 	// Settings for the snapping.

snapControls
{
  nSmoothPatch 3;
  tolerance 4.0;
  nSolveIter 30;
  nRelaxIter 5;
  nFeatureSnapIter 15;
  implicitFeatureSnap no;
  explicitFeatureSnap yes;
  multiRegionFeatureSnap no;
} 	// Settings for the layer addition.

addLayersControls
{
  relativeSizes no;
  layers
  {
    insides
    {
      nSurfaceLayers 3;
    }
  }
  expansionRatio 1.3;
  finalLayerThickness 0.3;
  minThickness 0.1;
  nGrow 0;
  featureAngle 60;
  slipFeatureAngle 30;
  nRelaxIter 3;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 90;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
}

meshQualityControls
{
#include "meshQualityDict"
} 	// Advanced// Write flags

writeFlags
  (
    scalarLevels
    layerSets
    layerFields
  ); 	// write volScalarField for layer coverage// Merge tolerance. Is fraction of overall bounding box of initial mesh.// Note: the write tolerance needs to be higher than this.

mergeTolerance 1e-06; 	// ************************************************************************* //

