environments/cfd/rand_env_10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

21
(
    auto0
    {
        type            wall;
        nFaces          2768;
        startFace       233911;
    }
    auto1
    {
        type            wall;
        nFaces          4133;
        startFace       236679;
    }
    auto2
    {
        type            wall;
        nFaces          990;
        startFace       240812;
    }
    auto3
    {
        type            wall;
        nFaces          6615;
        startFace       241802;
    }
    auto4
    {
        type            wall;
        nFaces          684;
        startFace       248417;
    }
    auto5
    {
        type            wall;
        nFaces          1284;
        startFace       249101;
    }
    auto6
    {
        type            wall;
        nFaces          6829;
        startFace       250385;
    }
    auto7
    {
        type            wall;
        nFaces          2661;
        startFace       257214;
    }
    auto8
    {
        type            wall;
        nFaces          885;
        startFace       259875;
    }
    auto9
    {
        type            wall;
        nFaces          1017;
        startFace       260760;
    }
    auto10
    {
        type            wall;
        nFaces          2532;
        startFace       261777;
    }
    auto11
    {
        type            wall;
        nFaces          1302;
        startFace       264309;
    }
    auto12
    {
        type            wall;
        nFaces          4148;
        startFace       265611;
    }
    auto13
    {
        type            wall;
        nFaces          858;
        startFace       269759;
    }
    auto14
    {
        type            wall;
        nFaces          4200;
        startFace       270617;
    }
    auto15
    {
        type            wall;
        nFaces          1097;
        startFace       274817;
    }
    auto16
    {
        type            wall;
        nFaces          1538;
        startFace       275914;
    }
    auto17
    {
        type            wall;
        nFaces          1188;
        startFace       277452;
    }
    auto18
    {
        type            wall;
        nFaces          1007;
        startFace       278640;
    }
    auto19
    {
        type            wall;
        nFaces          1173;
        startFace       279647;
    }
    auto20
    {
        type            wall;
        nFaces          1964;
        startFace       280820;
    }
)

// ************************************************************************* //
